# Требуется найти в массиве A[1..N] самый близкий по
# величине элемент к заданному числу X. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В
# последующих строках записаны N целых чисел A.
# Последняя строка
# содержит число X
# 5
# 1 2 3 4 5
# 6
# -> 5

list_1 = [1, 2, 3, 4, 5]
k = -1

m = abs(list_1[0] - k)
number = list_1[0]
if k in list_1:
  number = k
else:
  for i in list_1:
    if m > abs(i - k):
        m = abs(i - k)
        number = i
print(number)